{
    "movies": [
        {
            "movieTitle": "Kung Fu Panda 4",
            "storyLine":"Po is gearing up to become the spiritual leader of his Valley of Peace, but also needs someone to take his place as Dragon Warrior. As such, he will train a new kung fu practitioner for the spot and will encounter a villain called the Chameleon who conjures villains from the past.",
            "tag":["Action","Adventure","Animation"],
            "rate":"6.6",
            "image":"https://m.media-amazon.com/images/M/MV5BZDY0YzI0OTctYjVhYy00MTVhLWE0NTgtYTRmYTBmOTE3YTViXkEyXkFqcGdeQXVyMTUzMTg2ODkz._V1_FMjpg_UX1000_.jpg"
        },
        {
            "movieTitle": "Dune: Part Two",
            "storyLine":"Paul Atreides unites with Chani and the Fremen while on a warpath of revenge against the conspirators who destroyed his family. Facing a choice between the love of his life and the fate of the known universe, he endeavors to prevent a terrible future only he can foresee.",
            "tag":["Action","Adventure","Drama"],
            "rate":"8.9",
            "image":"https://preview.redd.it/dune-part-2-fan-art-poster-by-beenum-editz-v0-5r4cp9ehtkob1.jpg?auto=webp&s=6d62ef8fe13a644d9681779d95a43e8fef15e071"
        },
        {
            "movieTitle": "Dune",
            "storyLine":"A mythic and emotionally charged hero's journey, Dune tells the story of Paul Atreides, a brilliant and gifted young man born into a great destiny beyond his understanding, who must travel to the most dangerous planet in the universe to ensure the future of his family and his people. As malevolent forces explode into conflict over the planet's exclusive supply of the most precious resource in existence-a commodity capable of unlocking humanity's greatest potential-only those who can conquer their fear will survive.",
            "tag":["Action","Adventure","Drama"],
            "rate":"8.9",
            "image":"https://m.media-amazon.com/images/M/MV5BMDQ0NjgyN2YtNWViNS00YjA3LTkxNDktYzFkZTExZGMxZDkxXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_FMjpg_UX1000_.jpg"
        },
        {
            "movieTitle": "Imaginary",
            "storyLine":"From Alejandro Monteverde, award-winning director of Sound of Freedom, comes the powerful epic of Francesca Cabrini, an Italian immigrant who arrives in New York City in 1889 and is greeted by disease, crime, and impoverished children. Cabrini sets off on a daring mission to convince the hostile mayor to secure housing and healthcare for society's most vulnerable. With broken English and poor health, Cabrini uses her entrepreneurial mind to build an empire of hope unlike anything the world had ever seen.",
            "tag":["Biography","Drama"],
            "rate":"4.8",
            "image":"https://m.media-amazon.com/images/M/MV5BODIzOTJiODUtNzM2MC00YjdjLTg5YTktZWZhNjY1N2I5NWRjXkEyXkFqcGdeQXVyMjY5ODI4NDk@._V1_.jpg"
        },
        {
            "movieTitle": "Bob Marley: One Love",
            "storyLine":"The story of how reggae icon Bob Marley overcame adversity, and the journey behind his revolutionary music.            ",
            "tag":["Biography","Drama","Music"],
            "rate":"6.5",
            "image":"https://m.media-amazon.com/images/M/MV5BY2U4M2NmY2ItMjAyNC00NzM1LTg3ZTEtNzVlYjEzNTE5NDI5XkEyXkFqcGdeQXVyMDM2NDM2MQ@@._V1_.jpg"
        },
        {
            "movieTitle": "Ordinary Angels",
            "storyLine":"Inspired by the incredible true story of a hairdresser who single-handedly rallies an entire community to help a widowed father save the life of his critically ill young daughter.",
            "tag":["Drama"],
            "rate":"7.8",
            "image":"https://m.media-amazon.com/images/M/MV5BYmY2YmEyYTItYjA4Yy00MTNmLTg1ZDgtNjFlM2QzMDI4MTM2XkEyXkFqcGdeQXVyMjM4NTM5NDY@._V1_FMjpg_UX1000_.jpg"
        },
        {
            "movieTitle": "Madame Web",
            "storyLine":"In a switch from the typical genre, Madame Web tells the standalone origin story of one of Marvel publishing's most enigmatic heroines. The suspense-driven thriller stars Dakota Johnson as Cassandra Webb, a paramedic in Manhattan who develops the power to see the future... and realizes she can use that insight to change it. Forced to confront revelations about her past, she forges a relationship with three young women bound for powerful destinies...if they can all survive a deadly present.",
            "tag":["Action","Adventure","Sci-Fi"],
            "rate":"3.7",
            "image":"https://m.media-amazon.com/images/M/MV5BYWJkY2Q4NmYtOGRlMi00YTg5LWE2ZmQtY2NkYzk3YTRmNWZlXkEyXkFqcGdeQXVyMTY3ODkyNDkz._V1_.jpg"
        },
        {
            "movieTitle": "Migration",
            "storyLine":"A family of ducks try to convince their overprotective father to go on the vacation of a lifetime.",
            "tag":["Animation","Adventure","Comedy"],
            "rate":"6.7",
            "image":"https://m.media-amazon.com/images/M/MV5BYTIxZDM5YWItM2Y1My00ODg5LTkzNjAtMWFlZTNlODg0MzEyXkEyXkFqcGdeQXVyMTA5ODEyNTc5._V1_.jpg"
        },
        {
            "movieTitle": "Re la gun tang",
            "storyLine":"After argument with younger sister, Le Ying moves out on her own. She meets a boxing trainer and starts boxing.",
            "tag":["Comedy","Drama","Sport"],
            "rate":"6.9",
            "image":"https://m.media-amazon.com/images/M/MV5BODEzNzUxMzAtNWQ4NC00Nzc5LWFmMjYtZTNiOWY4YTJhODRjXkEyXkFqcGdeQXVyNjMzOTMzMDM@._V1_.jpg"
        },
        {
            "movieTitle": "Episode #4.7",
            "storyLine":"",
            "tag":["Drama","History"],
            "rate":"9.0",
            "image":"https://m.media-amazon.com/images/M/MV5BNzkyZTcxMjktNDI5ZC00MjZjLTk1MTctNjNjMjVkOTQ5ZjViXkEyXkFqcGdeQXVyMTAxNzQ1NzI@._V1_SY278_CR2,0,184,278_.jpg"
        }
    ]
}